{
  "mixed": {
    "default": "${path} содержит недопустимое значение",
    "required": "${path} является обязательным полем",
    "oneOf": "${path} должно быть одно из следующих значений: ${values}",
    "notOneOf": "${path} не должно быть одним из следующих значений: ${values}"
  },
  "string": {
    "length": "${path} длинна должна быть равной ${length}",
    "min": "${path} длинна должна быть не меньше ${min} символов",
    "max": "${path} длинна должна быть не больше ${max} символов",
    "matches": "${path} не соответствует требуемому паттерну: \"${regex}\"",
    "email": "${path} должен быть валидным email-адресом",
    "url": "${path} должен быть валидным URL",
    "trim": "${path} не должен содержать пробельные символы в начале или конце строки",
    "lowercase": "${path} должен содержать только строчные символы",
    "uppercase": "${path} должен содержать только заглавные символы"
  },
  "number": {
    "min": "${path} должен быть не меньше ${min}",
    "max": "${path} должен быть не больше ${max}",
    "lessThan": "${path} должен быть меньше ${less}",
    "moreThan": "${path} должен быть больше ${more}",
    "notEqual": "${path} должен быть равен ${notEqual}",
    "positive": "${path} должен быть положительным числом",
    "negative": "${path} должен быть отрицательным числом",
    "integer": "${path} должен быть числом"
  },
  "date": {
    "min": "${path} должен быть не раньше ${min}",
    "max": "${path} должен быть не позже ${max}"
  },
  "object": {
    "noUnknown": "${path} поле не может иметь ключи, не указанные в форме объекта"
  },
  "array": {
    "min": "${path} должен содержать не меньше ${min} элементов",
    "max": "${path} должен содержать не больше ${max} элементов"
  },
  "captcha": {
    "keyRequired": "Капча не загружена, обновите картинку",
    "required": "Введите буквы с картинки"
  },
  "accountFormat": {
    "default": "Неверный адрес кошелька",
    "PMUSD": "Вы ввели неверный Номер кошелька Perfect Money. Номер кошелька должен соответствовать шаблону U1234567",
    "PMEUR": "Вы ввели неверный Номер кошелька Perfect Money. Номер кошелька должен соответствовать шаблону E123456",
    "SBERRUB": "Вы ввели неверный Номер карты Сбербанка, номер карты должен содержать 16 - 18 цифр",
    "TCSBRUB": "Вы ввели неверный Номер карты Тинькофф, номер карты должен содержать 16 цифр",
    "YAMRUB": "Вы ввели неверный Номер кошелька Яндекс.Деньги. Кошелек должен содержать от 10 до 16 цифр",
    "QWRUB": "Вы ввели неверный Номер QIWI кошелька. Обратите внимание! Вывод Qiwi на кошельки +380 невозможен.",
    "TBRUB": "Вы ввели неверный Номер счета в Телебанке, номер счета должен содержать 20 цифр",
    "BTC": "Вы ввели неверный Номер кошелька BTC. Пример: 3BHPaGuxZ3ozPmeEDcmBpfcGCGLh1iBGWV",
    "ACRUB": "Вы ввели неверный Номер счета в АльфаКлик, номер счета должен содержать 20 цифр",
    "PRUSD": "Вы ввели неверный Номер кошелька Payeer. Номер кошелька должен соответствовать шаблону P1234567, P1234567890",
    "PREUR": "Вы ввели неверный Номер кошелька Payeer. Номер кошелька должен соответствовать шаблону P1234567, P1234567890",
    "LTC": "Вы ввели неверный Номер кошелька LiteCoin. Пример: Lchanger9aqdHS5KKFz322FVH74LnzkoYJ",
    "ETH": "Вы ввели неверный Номер кошелька Ethereum. Пример: 0x54065a7b2b86274D52A755F73E534DcD7d522886",
    "ADVCUSD": "Вы ввели неверный Номер кошелька AdvCash USD. Номер кошелька должен соответствовать шаблону U 3005 2342 8775",
    "ADVCEUR": "Вы ввели неверный Номер кошелька AdvCash EUR. Номер кошелька должен соответствовать шаблону E 3005 2342 8775",
    "CARDRUB": "Вы ввели неверный Номер карты в Visa/MasterCard RUB, номер карты должен содержать от 16 до 22 цифр",
    "PRRUB": "Вы ввели неверный Номер кошелька Payeer RUB. Номер кошелька должен соответствовать шаблону P1234567, P1234567890",
    "ADVCRUB": "Вы ввели неверный Номер кошелька AdvCash RUB. Номер кошелька должен соответствовать шаблону R 3005 2342 8775",
    "OKUSD": "Вы ввели неверный Номер кошелька OKPay. Номер кошелька должен соответствовать шаблону OK370835665",
    "DASH": "Вы ввели неверный Номер кошелька Dash. Пример: XmzgzKSournZBFCG19ZHv3cFVamm6CwYcR",
    "KUKRUB": "Вы ввели неверный Номер карты Кукуруза, номер карты должен содержать 16 цифр",
    "SBERKZT": "Вы ввели неверный Номер карты Сбербанка KZT, номер карты должен содержать 16 - 18 цифр",
    "KKBKZT": "Вы ввели неверный Номер карты QazKom Bank, номер карты должен содержать 16 - 18 цифр",
    "HLKBKZT": "Вы ввели неверный Номер карты Halyk Bank, номер карты должен содержать 16 - 18 цифр",
    "FRTBKZT": "Вы ввели неверный Номер карты Forte Bank, номер карты должен содержать 16 - 18 цифр",
    "CARDKZT": "Вы ввели неверный Номер карты Visa/Mastercard KZT, номер карты должен содержать 16 - 22 цифр",
    "XRP": "Вы ввели неверный Номер кошелька Ripple. Пример: 50dc2d6de07e8c76ab25a2cca4b4a9bf9f",
    "ETC": "Вы ввели неверный Номер кошелька Ethereum Classic. Пример: 0x0C93dCc706A5A33DD61A620444EB0B20D4c26754",
    "XMR": "Вы ввели неверный Номер кошелька Monero. Пример: 46R22YTm8hJbXmxy6i932NNQ3ddBimFSmVLbXDT1iFQyDfY1FLCSmi5WbwaVe4vUMveKAzAiA4j8xgUi29TpKXpm42mKo4j",
    "BCH": "Вы ввели неверный Номер кошелька BCH. Пример: 3BHPaGuxZ3ozPmeEDcmBpfcGCGLh1iBGWV,bitcoincash:qpc5s69rvur79205p4zqryjfwsh5utcdy5yldx9z3z",
    "ZEC": "Вы ввели неверный Номер кошелька Zcash. Пример: t1ZsYjAFddSMi5sKZntMCur3rxjhTnUBuwz",
    "NEO": "Вы ввели неверный Номер кошелька Neo. Пример: AeSvadFBSFLuL4jCP52itaN9T3LsT8tNte",
    "USDT": "Вы ввели неверный Номер кошелька Tether OMNI. Пример: 16KFCwBeLvJQQGgMLdaPNXHVmpUFWzHgpU",
    "USDTERC20": "Вы ввели неверный Номер кошелька Tether ERC20. Пример: 0x754d555efacc1a2446c0c897b0e8e43234d2575d",
    "EOS": "Вы ввели неверный Номер кошелька EOS. Пример: EOS8dUSkq29YwV3DueZeqr7Bpw1nyLEbquqFqiW5D95ijV7LQARoN",
    "XEM": "Вы ввели неверный Номер кошелька NEM. Пример: NAMOAV-HFVPJ6-FP32YP-2GCM64-WSRMKX-A5KKYW-WHPY",
    "ADA": "Вы ввели неверный Номер кошелька Cardano. Пример: DdzFFzCqrhsrUjfMwJrzuQF8DeXJMgrmxFxMUE6tcLKpyA3YvAptZEFBgBo14a5qWMR8xrNEckqf9AG9VP7ofDketqXCPeSztCizzkEN",
    "TRX": "Вы ввели неверный Номер кошелька Tron. Пример: TQ4JxJYyVG7ACEhkAxBKv1Y4WjUuAAroMt",
    "WAVES": "Вы ввели неверный Номер кошелька Waves. Пример: 3PGqbTfzqt4f6SknevzdADxvEj5p4xiKw7i",
    "CARDEUR": "Вы ввели неверный Номер карты Visa/Mastercard EUR, номер карты должен содержать 16 - 22 цифр",
    "HUMOUZS": "Вы ввели неверный Номер карты HUMO, номер карты должен содержать 16 - 22 цифр",
    "UZCUZS": "Вы ввели неверный Номер карты UZCARD, номер карты должен содержать 16 - 22 цифр",
    "USDTTRC20": "Вы ввели неверный Номер кошелька Tether TRC20. Пример: TDFeTz2ApzrERVuMmAcJGR2tuMVSGMGumu",
    "USDTBEP20": "Вы ввели неверный Номер кошелька Tether BEP20",
    "DOGE": "Вы ввели неверный Номер кошелька Dogecoin. Пример: DJvQJT54oZpAqfJib7MqxjLDGbsVveEXMU",
    "DOT": "Вы ввели неверный Номер кошелька Polkadot. Пример: 15m4QTNSUrpuoTQzLaeSJisy7dEUs9Jc8z22W4kQKvUeoUjb",
    "XLM": "Вы ввели неверный Номер кошелька Stellar (XLM). Пример: GAHK7EEG2WWHVKDNT4CEQFZGKF2LGDSW2IVM4S5DP42RBW3K6BTODB4A, не забудьте указать MEMO",
    "MIRCRUB": "Вы ввели неверный Номер карты МИР, номер карты должен содержать 16 - 18 цифр",
    "BNBBEP2": "Вы ввели неверный Номер кошелька BNB BEP 2. Пример: bnb136ns6lfw4zs5hg4n85vdthaad7hq5m4gtkgf23, не забудьте указать MEMO",
    "BNBBEP20": "Вы ввели неверный Номер кошелька BNB BEP 20. Пример: 0x59f502498d9225e1a71bd3509722ac43ab389e1e" 
  }
}
